{
  "questoes": [
    {
      "id": "01",
      "questao": "Quais das seguintes afirmações descrevem um objetivo de teste válido?",
      "alternativas": {
        "A": "Para provar que não há defeitos não corrigidos no sistema em teste",
        "B": "Para provar que não haverá falhas após a implementação do sistema na produção",
        "C": "Reduzir o nível de risco do objeto de teste e aumentar a confiança no nível de qualidade",
        "D": "Para verificar se não há combinações não testadas de entradas"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagens": [],
      "level": "K1"
    },
    {
      "id": "02",
      "questao": "Qual das opções a seguir mostra um exemplo que contribui para o sucesso das atividades de teste?",
      "alternativas": {
        "A": "O envolvimento dos testadores durante várias atividades do ciclo de vida de desenvolvimento de software (SDLC) ajudará a detectar defeitos nos produtos de trabalho",
        "B": "Os testadores tentam não perturbar os desenvolvedores durante a codificação, para que eles escrevam um código melhor",
        "C": "Os testadores que colaboram com os usuários finais ajudam a melhorar a qualidade dos relatórios de defeitos durante a integração de componentes e o teste do sistema",
        "D": "Os testadores certificados modelarão casos de teste muito melhores do que os testadores não certificados"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "03",
      "questao": "Você foi designado como testador de uma equipe que está produzindo um novo sistema de forma incremental. Você notou que nenhuma alteração foi feita nos casos de teste de regressão existentes durante várias iterações e nenhum novo defeito de regressão foi identificado. Seu gerente está feliz, mas você não está. Qual princípio de teste explica seu ceticismo?",
      "alternativas": {
        "A": "Os testes se desgastam",
        "B": "Falácia da ausência de erros",
        "C": "Os defeitos se agrupam",
        "D": "É impossível realizar testes exaustivos"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "04",
      "questao": "Você trabalha em uma equipe que desenvolve um aplicativo móvel para pedidos de comida. Na iteração atual, a equipe decidiu implementar a funcionalidade de pagamento. Qual das atividades a seguir faz parte da análise de teste?",
      "alternativas": {
        "A": "Estimativa de que o teste da integração com o serviço de pagamento levará 8 dias/homem",
        "B": "Decidir que a equipe deve testar se é possível realizar o pagamento entre muitos usuários",
        "C": "Usar a análise de valor limite (BVA) para derivar os dados de teste para os casos de teste que verificam o processamento correto do pagamento para o valor mínimo permitido a ser pago",
        "D": "Analisar a discrepância entre o resultado atual e o resultado esperado após a execução de um caso de teste que verifica o processo de pagamento com cartão de crédito e relatar um defeito"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "05",
      "questao": "Quais dos seguintes fatores (i-v) têm influência SIGNIFICATIVA no processo de teste?<br><br>i. O SDLC;<br>ii. O número de defeitos detectados em projetos anteriores;<br>iii. Os riscos identificados do produto;<br>iv. Novos requisitos regulatórios forçando;<br>v. O número de testadores certificados na organização;",
      "alternativas": {
        "A": "i, ii têm influência significativa; iii, iv, v não têm",
        "B": "i, iii, iv têm influência significativa; ii, v não têm",
        "C": "ii, iv, v têm influência significativa; i, iii não têm",
        "D": "iii, v têm influência significativa; i, ii, iv não têm"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "06",
      "questao": "Quais das DUAS tarefas a seguir pertencem PRINCIPALMENTE a um papel no teste?",
      "alternativas": {
        "A": "Configurar ambientes de teste",
        "B": "Manter o backlog do produto",
        "C": "Projetar soluções para novos requisitos",
        "D": "Criar o plano de teste",
        "E": "Relatório sobre a cobertura alcançada"
      },
      "correta": ["A", "E"],
      "erradas": ["B", "C", "D"],
      "tipo": "Checkbox",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "07",
      "questao": "Quais das seguintes habilidades (i-v) são as MAIS importantes para um testador?<br><br>i. Ter conhecimento do domínio;<br>ii. Criação de uma visão do produto;<br>iii. Ser um bom membro da equipe;<br>iv. Planejar e organizar o trabalho da equipe;<br>v. Pensamento crítico;",
      "alternativas": {
        "A": "ii e iv são importantes; i, iii e v não são",
        "B": "i, iii e v são importantes; ii e iv não são",
        "C": "i, ii e v são importantes; iii e iv não são",
        "D": "iii e iv são importantes; i, ii e v não são"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "08",
      "questao": "Como a abordagem de equipe inteira está presente nas interações entre os testadores e os representantes da empresa?",
      "alternativas": {
        "A": "Os representantes do negócio decidem sobre as abordagens de automação de testes",
        "B": "Os testadores ajudam os representantes da empresa a definir a estratégia de teste",
        "C": "Os representantes de negócio não participam da abordagem de equipe inteira",
        "D": "Os testadores ajudam os representantes de negócio a criar testes de aceite adequados"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "09",
      "questao": "Considere a seguinte regra: 'para cada atividade do SDLC, há uma atividade de teste correspondente'. Em quais modelos de SDLC essa regra é válida?",
      "alternativas": {
        "A": "Somente em modelos sequenciais",
        "B": "Somente em modelos iterativos",
        "C": "Somente em modelos iterativos e incrementais",
        "D": "Em modelos de sequenciais, incrementais e iterativos"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "10",
      "questao": "Qual das seguintes afirmações descreve MELHOR a abordagem de desenvolvimento orientado por testes de aceite (ATDD)?",
      "alternativas": {
        "A": "No ATDD, os critérios de aceite geralmente são criados com base no formato dado/quando/então",
        "B": "No ATDD, os casos de teste são criados principalmente no teste de componentes e são orientados para o código",
        "C": "No ATDD, os testes são criados com base em critérios de aceite para orientar o desenvolvimento do software",
        "D": "No ATDD, os testes são baseados no comportamento desejado do software, o que facilita a compreensão dos membros da equipe"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "11",
      "questao": "Qual das opções a seguir NÃO é um exemplo da abordagem shift-left?",
      "alternativas": {
        "A": "Revisar os requisitos do usuário antes que eles sejam formalmente aceitos pelos stakeholders",
        "B": "Escrever um teste de componente antes que o código correspondente seja escrito",
        "C": "Execução de um teste de eficiência de performance para um componente durante o teste do componente",
        "D": "Escrever um script de teste antes de definir o processo de gerenciamento de configuração"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "12",
      "questao": "Qual dos argumentos abaixo você usaria para convencer seu gerente a organizar retrospectivas no final de cada ciclo de lançamento?",
      "alternativas": {
        "A": "As retrospectivas são muito populares hoje em dia e os clientes gostariam que as adicionássemos aos nossos processos",
        "B": "A organização de retrospectivas economizará dinheiro, pois os representantes dos usuários finais não fornecem feedback imediato sobre o produto",
        "C": "Os pontos fracos do processo, identificados durante a retrospectiva, podem ser analisados e servir como uma lista de tarefas para o programa de melhoria contínua do processo da organização",
        "D": "As retrospectivas adotam cinco valores, incluindo coragem e respeito, que são cruciais para manter o aprimoramento contínuo na organização"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "13",
      "questao": "Quais tipos de falhas (1-4) se encaixam melhor em quais níveis de teste (A-D)?",
      "alternativas": {
        "A": "1D, 2B, 3A, 4C",
        "B": "1D, 2B, 3C, 4A",
        "C": "1B, 2A, 3D, 4C",
        "D": "1C, 2B, 3A, 4D"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoA/Q13.png"],
      "level": "K2"
    },
    {
      "id": "14",
      "questao": "Você está testando uma história de usuário com três critérios de aceite: AC1, AC2 e AC3. O AC1 é coberto pelo caso de teste TC1, o AC2 pelo TC2 e o AC3 pelo TC3. O histórico de execução do teste teve três execuções de teste em três versões consecutivas do software. Quais dos testes acima são executados como testes de regressão?",
      "alternativas": {
        "A": "4, 7, 8, 9",
        "B": "5, 7",
        "C": "4, 6, 8, 9",
        "D": "5, 6"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoA/Q14.png"],
      "level": "K2"
    },
    {
      "id": "15",
      "questao": "Qual das opções a seguir NÃO é um benefício dos testes estáticos?",
      "alternativas": {
        "A": "Ter um gerenciamento de defeitos menos dispendioso devido à facilidade de detectar defeitos mais tarde no processo SDLC",
        "B": "A correção de defeitos encontrados durante o teste estático geralmente é muito mais barata do que a correção de defeitos encontrados durante o teste dinâmico",
        "C": "Encontrar defeitos de codificação que poderiam não ter sido encontrados apenas com a realização de testes dinâmicos",
        "D": "Detecção de lacunas e inconsistências nos requisitos"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "16",
      "questao": "Qual dos seguintes é um benefício do feedback antecipado e frequente?",
      "alternativas": {
        "A": "Melhora o processo de teste para projetos futuros",
        "B": "Ele força os clientes a priorizarem seus requisitos com base nos riscos acordados",
        "C": "Essa é a única maneira de medir a qualidade das mudanças",
        "D": "Isso ajuda a evitar mal-entendidos sobre os requisitos"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "17",
      "questao": "As revisões que estão sendo usadas em sua organização têm os seguintes atributos: há o papel de um redator; o principal objetivo é avaliar a qualidade; a reunião é conduzida pelo autor do produto de trabalho; há uma preparação individual; é produzido um relatório de revisão. Qual dos seguintes tipos de revisão é MAIS provável que esteja sendo usado?",
      "alternativas": {
        "A": "Revisão informal",
        "B": "Walkthrough",
        "C": "Revisão técnica",
        "D": "Inspeção"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "18",
      "questao": "Qual dessas afirmações NÃO é um fator que contribui para revisões bem-sucedidas?",
      "alternativas": {
        "A": "Os participantes devem dedicar tempo suficiente para a análise",
        "B": "Dividir grandes produtos de trabalho em pequenas partes para tornar o esforço necessário menos intenso",
        "C": "Os participantes devem evitar comportamentos que possam indicar tédio, exasperação ou hostilidade com outros participantes",
        "D": "As falhas encontradas devem ser reconhecidas, apreciadas e tratadas de forma objetiva"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "19",
      "questao": "Qual das seguintes é uma característica das técnicas de teste baseadas em experiência?",
      "alternativas": {
        "A": "Os casos de teste são criados com base em informações detalhadas do projeto",
        "B": "Os itens testados na seção de código da interface são usados para medir a cobertura",
        "C": "As técnicas dependem muito do conhecimento do testador sobre o software e o domínio do negócio",
        "D": "Os casos de teste são usados para identificar desvios dos requisitos"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "20",
      "questao": "Você está testando um formulário simplificado de busca de apartamento que tem apenas dois critérios de busca: andar (com três opções possíveis: térreo; primeiro andar; segundo andar) e tipo de jardim (com três opções possíveis: sem jardim; jardim pequeno; jardim grande). Somente apartamentos no andar térreo podem ter jardins. O formulário tem um mecanismo de validação integrado que não permitirá que você use os critérios de pesquisa que violam essa regra. Qual é o número mínimo de casos de teste para atingir 100% de cobertura do EP?",
      "alternativas": {
        "A": "3",
        "B": "4",
        "C": "5",
        "D": "6"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K3"
    },
    {
      "id": "21",
      "questao": "Você está testando um sistema que calcula a nota final do curso para um determinado aluno. A nota final é atribuída com base no resultado final de pontos, de acordo com as regras a seguir: 0 a 50 - Reprovado; 51 a 60 - Razoável; 61 a 70 - Satisfatório; 71 a 80 - Bom; 81 a 90 - Muito Bom; 91 a 100 - Excelente. Qual é a cobertura da Análise de Valor Limite - BVA (Boundary Value Analysis) de dois valores para o resultado final obtido com os casos de teste existentes?",
      "alternativas": {
        "A": "50%",
        "B": "60%",
        "C": "33.3%",
        "D": "100%"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoA/Q21a.png", "./assets/img/SimuladoA/Q21b.png"],
      "level": "K3"
    },
    {
      "id": "22",
      "questao": "Sua loja favorita de aluguel de bicicletas acaba de lançar um novo sistema de Gerenciamento de Relacionamento com o Cliente e pediu a você, um dos membros mais fiéis, que o testasse. Com base APENAS na descrição dos recursos do sistema de Gerenciamento de Relacionamento com o Cliente, qual das regras acima descreve uma situação impossível?",
      "alternativas": {
        "A": "R4",
        "B": "R2",
        "C": "R6",
        "D": "R8"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoA/Q22.png"],
      "level": "K3"
    },
    {
      "id": "23",
      "questao": "Você testa um sistema cujo ciclo de vida é modelado pelo diagrama de transição de estado mostrado abaixo. O sistema começa no estado INIT e termina sua operação no estado OFF. Qual é o número MÍNIMO de casos de teste para obter uma cobertura de transições válida?",
      "alternativas": {
        "A": "4",
        "B": "2",
        "C": "7",
        "D": "3"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoA/Q23.png"],
      "level": "K3"
    },
    {
      "id": "24",
      "questao": "Seu conjunto de testes atingiu 100% de cobertura de instrução. Qual é a consequência desse fato?",
      "alternativas": {
        "A": "Cada instrução no código que contém um defeito foi executada pelo menos uma vez",
        "B": "Qualquer conjunto de testes que contenha mais casos de teste do que o seu conjunto de testes também alcançará 100% de cobertura de instrução",
        "C": "Cada caminho no código foi executado pelo menos uma vez",
        "D": "Cada combinação de valores de entrada foi testada pelo menos uma vez"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "25",
      "questao": "Qual das opções a seguir NÃO é verdadeira para testes caixa-branca?",
      "alternativas": {
        "A": "Durante o teste caixa-branca, toda a implementação do software é considerada",
        "B": "As métricas de cobertura caixa-branca podem ajudar a identificar testes adicionais para aumentar a cobertura do código",
        "C": "As técnicas de teste caixa-branca podem ser usadas em testes estáticos",
        "D": "O teste caixa-branca pode ajudar a identificar lacunas na implementação dos requisitos"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "26",
      "questao": "Qual das opções a seguir descreve MELHOR o conceito por trás da suposição de erros?",
      "alternativas": {
        "A": "A suposição de erros envolve o uso de seu conhecimento e experiência de defeitos encontrados no passado e erros típicos cometidos por desenvolvedores",
        "B": "A suposição de erros envolve o uso de sua experiência pessoal de desenvolvimento e os erros que você cometeu como desenvolvedor",
        "C": "A suposição de erros exige que você imagine que é o usuário do objeto de teste e adivinhe os erros que o usuário poderia cometer ao interagir com ele",
        "D": "A suposição de erros exige que você duplique rapidamente a tarefa de desenvolvimento para identificar os tipos de erros que um desenvolvedor pode cometer"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "27",
      "questao": "Em seu projeto, houve um atraso no lançamento de um aplicativo totalmente novo e a execução do teste começa tarde, mas você tem um conhecimento de domínio muito detalhado e boas habilidades analíticas. A lista completa de requisitos ainda não foi compartilhada com a equipe, mas a gerência está pedindo que alguns resultados de testes sejam apresentados. Qual técnica de teste se encaixa MELHOR nessa situação?",
      "alternativas": {
        "A": "Testes baseados em listas de verificação",
        "B": "Suposição de erros",
        "C": "Testes exploratórios",
        "D": "Teste de ramificação"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "28",
      "questao": "Qual das opções a seguir descreve MELHOR a maneira como os critérios de aceite podem ser documentados?",
      "alternativas": {
        "A": "Realizar retrospectivas para determinar as necessidades reais dos stakeholders em relação a uma determinada história de usuário",
        "B": "Usar o formato dado/quando/então para descrever um exemplo de condição de teste relacionada a uma determinada história de usuário",
        "C": "Usar a comunicação verbal para reduzir o risco de outras pessoas não entenderem os critérios de aceite",
        "D": "Documentar os riscos relacionados a uma determinada história de usuário em um plano de teste para facilitar o teste baseado em riscos de uma determinada história de usuário"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "29",
      "questao": "Considere a seguinte história de usuário: 'Como editor, quero revisar o conteúdo antes de ser publicado, para que eu possa garantir que a gramática esteja correta', e seus critérios de aceite. Qual dos seguintes é o MELHOR exemplo de um teste ATDD para essa história de usuário?",
      "alternativas": {
        "A": "testar se o editor pode salvar o documento após excluir o conteúdo da página",
        "B": "testar se o proprietário do conteúdo pode fazer login e fazer atualizações no conteúdo",
        "C": "testar se o editor pode programar o conteúdo editado para publicação",
        "D": "testar se o editor pode reatribuir a outro editor para fazer atualizações"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K3"
    },
    {
      "id": "30",
      "questao": "Como os testadores agregam valor aos planejamentos de iteração e lançamento?",
      "alternativas": {
        "A": "Os testadores determinam a prioridade das histórias de usuários a serem desenvolvidas",
        "B": "Os testadores se concentram apenas nos aspectos funcionais do sistema a ser testado",
        "C": "Os testadores participam da identificação de riscos e da avaliação de riscos das histórias de usuários",
        "D": "Os testadores garantem o lançamento de software de alta qualidade por meio de um projeto de teste antecipado durante o planejamento do lançamento"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "31",
      "questao": "Quais das DUAS opções a seguir são os critérios de saída para testar um sistema?",
      "alternativas": {
        "A": "Prontidão do ambiente de teste",
        "B": "A capacidade do testador de fazer login no objeto de teste",
        "C": "A densidade de defeitos estimada é atingida",
        "D": "Os requisitos são traduzidos para o formato dado/quando/então",
        "E": "Os testes de regressão são automatizados"
      },
      "correta": ["C", "E"],
      "erradas": ["A", "B", "D"],
      "tipo": "Checkbox",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "32",
      "questao": "Sua equipe usa a técnica de estimativa de três pontos para estimar o esforço de teste de um novo recurso de alto risco. Foram feitas as seguintes estimativas: Estimativa mais otimista: 2 homens/hora; Estimativa mais provável: 11 homens/hora; Estimativa mais pessimista: 14 homens/hora. Qual é a estimativa final?",
      "alternativas": {
        "A": "9 homens/hora",
        "B": "14 homens/hora",
        "C": "11 homens/hora",
        "D": "10 homens/hora"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K3"
    },
    {
      "id": "33",
      "questao": "Você está testando um aplicativo móvel que permite que os usuários encontrem um restaurante próximo com base no tipo de comida que desejam comer. Considere a seguinte lista de casos de teste, prioridades (ou seja, um número menor significa uma prioridade maior) e dependências. Qual dos seguintes casos de teste deve ser o terceiro a ser executado?",
      "alternativas": {
        "A": "TC 003",
        "B": "TC 005",
        "C": "TC 002",
        "D": "TC 001"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoA/Q33.png"],
      "level": "K3"
    },
    {
      "id": "34",
      "questao": "Considere as seguintes categorias de teste (1-4) e os quadrantes de teste ágil (A-D). Como as seguintes categorias de teste são mapeadas nos quadrantes de teste ágil?",
      "alternativas": {
        "A": "1C, 2A, 3B, 4D",
        "B": "1D, 2A, 3C, 4B",
        "C": "1C, 2B, 3D, 4A",
        "D": "1D, 2B, 3C, 4A"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoA/Q34.png"],
      "level": "K2"
    },
    {
      "id": "35",
      "questao": "Durante uma análise de risco, o seguinte risco foi identificado e avaliado: Risco: o tempo de resposta é muito longo para gerar um relatório; Probabilidade do risco: média; Impacto do risco: alto; Resposta ao risco: (1) uma equipe de teste independente realiza testes de performance durante o teste do sistema; (2) uma amostra selecionada de usuários finais realiza testes de aceite alfa e beta antes do lançamento. Que medida é proposta para ser tomada em resposta a esse risco analisado?",
      "alternativas": {
        "A": "Aceite de riscos",
        "B": "Plano de contingência",
        "C": "Mitigação de riscos",
        "D": "Transferência de risco"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagens": [],
      "level": "K2"
    },
    {
      "id": "36",
      "questao": "Qual ferramenta pode ser usada por uma equipe ágil para mostrar a quantidade de trabalho que foi concluída e a quantidade de trabalho total restante para uma determinada iteração?",
      "alternativas": {
        "A": "Critérios de aceite",
        "B": "Relatório de defeitos",
        "C": "Relatório de conclusão do teste",
        "D": "Gráfico de Burndown"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "37",
      "questao": "Você precisa atualizar um dos scripts de teste automatizados para que esteja de acordo com um novo requisito. Qual processo indica que você deve criar uma nova versão do script de teste no repositório de testes?",
      "alternativas": {
        "A": "Gerenciamento de Rastreabilidade",
        "B": "Teste de Manutenção",
        "C": "Gerenciamento de Configuração",
        "D": "Engenharia de Requisitos"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "38",
      "questao": "Você recebeu o seguinte relatório de defeito dos desenvolvedores afirmando que a anomalia descrita neste relatório de teste não é reproduzível. Que informações essenciais estão FALTANDO nesse relatório de teste que teriam sido úteis para os desenvolvedores?",
      "alternativas": {
        "A": "Resultado esperado e resultado real",
        "B": "Referências e status do defeito",
        "C": "Ambiente de teste e item de teste",
        "D": "Prioridade e gravidade"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K3"
    },
    {
      "id": "39",
      "questao": "Qual atividade de teste é suportada por uma ferramenta de preparação de dados?",
      "alternativas": {
        "A": "Monitoramento e controle de testes",
        "B": "Análise e projeto de testes",
        "C": "Implementação e execução de testes",
        "D": "Conclusão do teste"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "40",
      "questao": "Qual item identifica corretamente um risco potencial de realizar a automação de testes?",
      "alternativas": {
        "A": "Ele pode introduzir regressões desconhecidas na produção",
        "B": "Esforços suficientes para manter o material de teste podem não ser alocados adequadamente",
        "C": "As ferramentas de teste e o material de teste associado podem não ser suficientemente confiáveis",
        "D": "Pode reduzir o tempo alocado para testes manuais"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    }
  ]
}