{
  "questoes": [
    {
      "id": "01",
      "questao": "Qual das alternativas a seguir é um exemplo do porquê o teste é necessário?",
      "alternativas": {
        "A": "O teste dinâmico aumenta a qualidade ao fazer com que os objetos de teste falhem de maneiras que nunca poderiam ser alcançadas pelos usuários.",
        "B": "O teste estático é usado pelos desenvolvedores para identificar falhas em seu código mais cedo do que seria possível por meio do teste dinâmico.",
        "C": "A análise estática fornece evidências aos clientes de que os elementos do sistema que não produzem saídas estão prontos para liberação.",
        "D": "As revisões aumentam a qualidade das especificações de requisitos e levam à necessidade de menos mudanças nos produtos de trabalho derivados."
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "02",
      "questao": "Qual das seguintes afirmações sobre garantia da qualidade (QA) e/ou controle da qualidade (QC) está correta?",
      "alternativas": {
        "A": "QA é realizada como parte do teste",
        "B": "O teste é realizado como parte do QC",
        "C": "Teste é outro termo para QC",
        "D": "O teste é realizado como parte do QA"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "03",
      "questao": "Um dos “princípios de teste” afirma que o teste exaustivo é impossível. Qual das seguintes alternativas é um exemplo de como abordar esse princípio na prática?",
      "alternativas": {
        "A": "Criar casos de teste que cubram todas as saídas especificadas possíveis",
        "B": "Documentar todas as variações possíveis de entradas de teste e priorizá-las com base na importância",
        "C": "Iniciar o teste o mais cedo possível, com revisões e outras abordagens de teste estático",
        "D": "Usar particionamento de equivalência e análise de valor limite para gerar casos de teste"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "04",
      "questao": "Qual atividade de teste envolve trabalhar com requisitos de dados de teste, condições de teste, requisitos de ambiente de teste e casos de teste?",
      "alternativas": {
        "A": "Projeto de teste",
        "B": "Execução de teste",
        "C": "Análise de teste",
        "D": "Implementação do teste"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "05",
      "questao": "Qual das alternativas a seguir é a que MAIS provavelmente impacta em como o teste é realizado para um determinado objeto de teste?",
      "alternativas": {
        "A": "O nível médio de experiência da equipe de marketing da organização",
        "B": "O conhecimento dos usuários de que um novo sistema está sendo desenvolvido para eles",
        "C": "O número de anos de experiência dos membros da equipe de teste",
        "D": "A estrutura organizacional do usuário final para um aplicativo comercial de streaming de música"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "06",
      "questao": "Qual das seguintes afirmações é um exemplo CORRETO do valor da rastreabilidade?",
      "alternativas": {
        "A": "A rastreabilidade entre os riscos mitigados e os casos de teste que passaram fornece um meio de determinar o nível de risco residual",
        "B": "A rastreabilidade entre os requisitos do usuário e os resultados de teste fornece um meio de medir o progresso do projeto em relação aos objetivos de negócio",
        "C": "A rastreabilidade entre os testadores e os casos de teste que falharam fornece um meio de determinar o nível de habilidade dos testadores",
        "D": "A rastreabilidade entre os riscos identificados e as condições de teste escritas fornece um meio de determinar quais riscos valem a pena testar"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "07",
      "questao": "Qual das alternativas a seguir é a que MAIS provavelmente representa um exemplo de um testador utilizando uma habilidade genérica durante o teste?",
      "alternativas": {
        "A": "O profundo conhecimento do testador sobre diversos jogos de computador fez com que ele se desse bem com um dos desenvolvedores que também gostava de jogos",
        "B": "O testador era um ex-piloto e conseguiu compreender melhor os critérios de aceitação para o sistema de controle de helicópteros",
        "C": "O testador já havia trabalhado como programador e utilizou suas habilidades nessa área para se comunicar melhor com os analistas de negócios",
        "D": "O testador foi muito cuidadoso para não cometer erros ao gerar metodicamente casos de teste antes de iniciar sua sessão de testes exploratórios"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "08",
      "questao": "Qual das seguintes é uma vantagem da abordagem de equipe inteira (whole-team approach)?",
      "alternativas": {
        "A": "Permite que os membros da equipe assumam qualquer função a qualquer momento",
        "B": "Necessita apenas de uma única equipe para dar suporte a todo o projeto de desenvolvimento",
        "C": "Incorpora representantes do negócio junto aos desenvolvedores na mesma equipe",
        "D": "Gera uma sinergia de equipe que beneficia todo o projeto"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "09",
      "questao": "Qual das seguintes afirmações sobre o ciclo de vida de desenvolvimento de software escolhido está CORRETA?",
      "alternativas": {
        "A": "Se o desenvolvimento ágil de software for utilizado, a automação dos testes de sistema substitui a necessidade de testes de regressão",
        "B": "Se um modelo de desenvolvimento sequencial for utilizado, então o teste dinâmico é tipicamente restrito às fases posteriores do ciclo de vida",
        "C": "Se um modelo de desenvolvimento iterativo for utilizado, então o teste de componentes é tipicamente realizado manualmente pelos desenvolvedores",
        "D": "Se um modelo de desenvolvimento incremental for utilizado, então o teste estático é feito nos primeiros incrementos e o teste dinâmico nos incrementos posteriores"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "10",
      "questao": "Dado que os testes que estão sendo realizados têm os seguintes atributos: • Com base nas especificações da interface • Focado em encontrar falhas na comunicação • A abordagem de teste utiliza tanto tipos de teste funcionais quanto estruturais Qual dos seguintes níveis de teste é o MAIS provável de ser realizado?",
      "alternativas": {
        "A": "Teste de integração",
        "B": "Teste de aceitação",
        "C": "Teste do sistema",
        "D": "Teste de componentes"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "11",
      "questao": "Qual das alternativas a seguir é um exemplo de abordagem de desenvolvimento orientada a testes (test-first approach)?",
      "alternativas": {
        "A": "Desenvolvimento Orientado por Testes (Test-Driven Development)",
        "B": "Desenvolvimento Orientado por Cobertura (Coverage-Driven Development)",
        "C": "Desenvolvimento Orientado por Qualidade (Quality-Driven Development)",
        "D": "Desenvolvimento Orientado por Funcionalidades (Feature-Driven Development)"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "12",
      "questao": "Qual das seguintes afirmações sobre DevOps está CORRETA?",
      "alternativas": {
        "A": "Para acelerar as entregas, a integração contínua é usada para incentivar os desenvolvedores a submeterem código rapidamente, sem a necessidade de concluir o teste de componentes",
        "B": "Para conseguir atualizar e liberar sistemas com mais frequência, muitos testes automatizados de regressão são necessários para reduzir o risco de regressão",
        "C": "Para tratar desenvolvedores e operações de forma igual, os testadores dedicarão mais esforço ao teste de liberação feito pelas operações, usando uma abordagem shift-right",
        "D": "Para criar maior sinergia entre testadores, desenvolvedores e operações, o teste deve se tornar totalmente automatizado, sem nenhum teste manual"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "13",
      "questao": "Qual das seguintes atividades é a MAIS provável de ser realizada como parte do teste de sistema?",
      "alternativas": {
        "A": "Teste de segurança de um sistema de gestão de crédito por uma equipe de teste independente",
        "B": "Teste da interface de um sistema de câmbio com um sistema bancário externoo",
        "C": "Teste beta de um sistema de ensino a distância realizado pelos desenvolvedores do material do curso",
        "D": "Teste das interações entre a interface do usuário e o banco de dados de um sistema de recursos humanos"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "14",
      "questao": "Qual das seguintes afirmações está CORRETA?",
      "alternativas": {
        "A": "Os testes de regressão aumentam em número à medida que o projeto avança, enquanto o número de testes de confirmação diminui à medida que o projeto avança",
        "B": "Os testes de regressão são criados e executados quando o objeto de teste é corrigido, enquanto os testes de confirmação são executados sempre que o objeto de teste é aprimorado",
        "C": "O teste de regressão está relacionado a verificar se o ambiente operacional permanece inalterado, enquanto o teste de confirmação está relacionado a testar mudanças no objeto de teste",
        "D": "O teste de regressão está relacionado a efeitos adversos em código não alterado, enquanto o teste de confirmação está relacionado a testar código alterado"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "15",
      "questao": "Qual das seguintes é um exemplo de defeito que pode ser encontrado por meio de teste estático, mas NÃO por meio de teste dinâmico?",
      "alternativas": {
        "A": "Falta de usabilidade fornecida pela interface do usuário",
        "B": "Código sem nenhum caminho que o alcance",
        "C": "Tempos de resposta ruins para a maioria dos usuários esperados",
        "D": "Funcionalidades obrigatórias que não estão implementadas no código"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "16",
      "questao": "Qual das seguintes é um benefício do feedback precoce e frequente das partes interessadas (stakeholders)?",
      "alternativas": {
        "A": "Os gerentes ficam cientes de quais desenvolvedores são menos produtivos",
        "B": "Permite que os gerentes de projeto priorizem suas interações com as partes interessadas",
        "C": "Facilita a comunicação antecipada de potenciais problemas de qualidade",
        "D": "Os usuários finais compreendem melhor por que a entrega do produto de trabalho está atrasada"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "17",
      "questao": "Dadas as seguintes descrições de tarefas: 1)As características de qualidade a serem avaliadas e os critérios de saída são selecionados; 2)Todos têm acesso ao produto de trabalho; 3)Anomalias são identificadas no produto de trabalho; 4)As anomalias são discutidas. E as seguintes atividades de revisão: A. Revisão individual; B. Iniciação da revisão; C. Planejamento; D. Comunicação e análise. Qual das seguintes alternativas corresponde MELHOR às descrições de tarefas e atividades?",
      "alternativas": {
        "A": "1B, 2C, 3D, 4A",
        "B": "1B, 2D, 3C, 4A",
        "C": "1C, 2A, 3B, 4D",
        "D": "1C, 2B, 3A, 4D"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "18",
      "questao": "Dadas as seguintes funções em revisões: 1)Escritor (Scribe); 2)Líder da revisão (Review leader); 3)Facilitador (Facilitator); 4)Gerente (Manager); E as seguintes responsabilidades em revisões: A. Garante o andamento eficaz das reuniões de revisão e a criação de um ambiente seguro para a revisão; B. Registra informações da revisão, como decisões e novas anomalias encontradas durante a reunião de revisão; C. Decide o que deve ser revisado e fornece recursos, como equipe e tempo para a revisão; D. Assume a responsabilidade geral pela revisão, como organizar quando e onde a revisão acontecerá; Qual das seguintes alternativas corresponde MELHOR às funções e responsabilidades?",
      "alternativas": {
        "A": "1A, 2B, 3D, 4C",
        "B": "1A, 2C, 3B, 4D",
        "C": "1B, 2D, 3A, 4C",
        "D": "1B, 2D, 3C, 4A"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "19",
      "questao": "Qual das seguintes afirmações descreve MELHOR a diferença entre o teste com tabela de decisão (decision table testing) e o teste de ramificações (branch testing)?",
      "alternativas": {
        "A": "No teste com tabela de decisão, os casos de teste são derivados das instruções de decisão no código. No teste de ramificações, os casos de teste são derivados do conhecimento do fluxo de controle do objeto de teste.",
        "B": "No teste com tabela de decisão, os casos de teste são derivados da especificação que descreve a lógica de negócio. No teste de ramificações, os casos de teste são baseados na antecipação de defeitos potenciais no código-fonte.",
        "C": "No teste com tabela de decisão, os casos de teste são derivados do conhecimento do fluxo de controle do objeto de teste. No teste de ramificações, os casos de teste são derivados da especificação que descreve a lógica de negócio.",
        "D": "No teste com tabela de decisão, os casos de teste são independentes de como o software é implementado. No teste de ramificações, os casos de teste só podem ser criados após o design ou implementação do código."
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "20",
      "questao": "Os clientes da rede de lava-rápido TestWash possuem cartões com um registro do número de lavagens que compraram até o momento. O valor inicial é 0. Após entrar no lava-rápido, o sistema aumenta o número no cartão em um. Esse valor representa o número da lavagem atual. Com base nesse número, o sistema decide qual desconto o cliente tem direito. Para cada décima lavagem, o sistema concede 10% de desconto, e a cada vigésima lavagem, o sistema concede mais 40% de desconto (ou seja, um total de 50% de desconto). Qual dos seguintes conjuntos de dados de entrada (entendidos como os números da lavagem atual) atinge a maior cobertura de partições de equivalência?",
      "alternativas": {
        "A": "Preto-4,5; Branco 1, 2; Experiência - 3",
        "B": "Preto 3; Branco 1, 2; Experiência - 4,5",
        "C": "Preto 4; Branco 1, 2; Experiência - 3,5",
        "D": "Preto 1, 3, 5; Branco - 2; Experiência - 4"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K3"
    },
    {
      "id": "21",
      "questao": "Você está testando um formulário que verifica a correção do tamanho da senha fornecida como entrada. O formulário aceita uma senha com o tamanho correto e rejeita uma senha que seja muito curta ou muito longa. O tamanho da senha é considerado correto se tiver entre 6 e 12 caracteres, inclusive. Caso contrário, é considerado incorreto. <p> Inicialmente, o formulário está vazio (tamanho da senha = 0). Você aplica a análise de valor limite à variável “tamanho da senha”. Seu conjunto de casos de teste alcança 100% de cobertura de valor limite 2-valores. A equipe decidiu que, devido ao alto risco deste componente, casos de teste adicionais devem ser incluídos para garantir 100% de cobertura de valor limite 3-valores.</p> <p>Quais comprimentos de senha adicionais devem ser testados para atingir isso?</p>",
      "alternativas": {
        "A": "4, 5, 13, 14",
        "B": "7, 11",
        "C": "1, 5, 13",
        "D": "1, 4, 7, 11, 14"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K3"
    },
    {
      "id": "22",
      "questao": "A tabela de decisão a seguir contém as regras para determinar o risco de aterosclerose.<br> Você projetou os casos de teste com os seguintes dados de entrada:<br>  1)TC1: Colesterol = 125 mg/dl, Pressão arterial = 141 mm Hg;<br> 2)TC2: Colesterol = 200 mg/dl, Pressão arterial = 201 mm Hg;<br> 3)TC3: Colesterol = 124 mg/dl, Pressão arterial = 201 mm Hg;<br> 4)TC4: Colesterol = 109 mg/dl, Pressão arterial = 200 mm Hg<br> 5)TC5: Colesterol = 201 mg/dl, Pressão arterial = 140 mm Hg",
      "alternativas": {
        "A": "40%",
        "B": "60%",
        "C": "80%",
        "D": "100%"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoB/Q22.png"],
      "level": "K3"
    },
    {
      "id": "23",
      "questao": "Um sistema de armazenamento pode armazenar até três elementos e é modelado pelo seguinte diagrama de transição de estados. A variável N representa o número de elementos atualmente armazenados.<br> Qual dos seguintes casos de teste, representados como sequências de eventos, atinge o maior nível de cobertura de transições válidas?",
      "alternativas": {
        "A": "Adicionar, Remover, Adicionar, Adicionar, Adicionar",
        "B": "Adicionar, Adicionar, Adicionar, Adicionar, Remover, Remover",
        "C": "Adicionar, Adicionar, Adicionar, Remover, Remover",
        "D": "Adicionar, Adicionar, Adicionar, Remover, Adicionar"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoB/Q23.png"],
      "level": "K3"
    },
    {
      "id": "24",
      "questao": "Você executa dois casos de teste, T1 e T2, no mesmo código. O teste T1 alcançou 40% de cobertura de instruções e o teste T2 alcançou 65% de cobertura de instruções.<br> Qual das seguintes afirmações deve ser necessariamente verdadeira?",
      "alternativas": {
        "A": "O conjunto de testes composto pelos testes T1 e T2 alcança 105% de cobertura de instruções",
        "B": "Existe pelo menos uma instrução que deve ter sido executada tanto pelo T1 quanto pelo T2",
        "C": "Pelo menos 5% das instruções no código testado são não-executáveis",
        "D": "O conjunto de testes composto pelos testes T1 e T2 alcança cobertura total de ramificações"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "25",
      "questao": "Seja a métrica de cobertura de ramificações definida como BCov = (X / Y) * 100%. O que X e Y representam nesta fórmula?",
      "alternativas": {
        "A": "X = número de resultados de decisão exercitados pelos casos de teste Y = número total de resultados de decisão no código",
        "B": "X = número de ramificações condicionais exercitadas pelos casos de teste Y = número total de ramificações no código",
        "C": "X = número de ramificações exercitadas pelos casos de teste Y = número total de ramificações no código",
        "D": "X = número de ramificações condicionais exercitadas pelos casos de teste Y = número total de resultados de decisão no código"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "26",
      "questao": "Quais DUAS das seguintes afirmações fornecem a MELHOR justificativa para usar testes exploratórios?",
      "alternativas": {
        "A": "Os testadores não receberam tempo suficiente para o design e execução de testes",
        "B": "A estratégia de teste existente exige que os testadores usem técnicas formais de teste de caixa-preta",
        "C": "A especificação está escrita em uma linguagem formal que pode ser processada por uma ferramenta",
        "D": "Os testadores são membros de uma equipe ágil e possuem boas habilidades de programação",
        "E": "Os testadores são experientes no domínio do negócio e possuem boas habilidades analíticas"
      },
      "correta": ["A", "E"],
      "erradas": ["B", "C", "D"],
      "tipo": "Checkbox",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "27",
      "questao": "Qual das alternativas a seguir SE ENCAIXA MELHOR como um elemento da checklist usada em testes baseados em checklist (checklist-based testing)?",
      "alternativas": {
        "A": "O desenvolvedor cometeu um erro ao implementar o código",
        "B": "A cobertura de instruções alcançada excede 85%",
        "C": "O programa funciona corretamente em relação aos requisitos funcionais e não funcionais",
        "D": "As mensagens de erro estão escritas em linguagem que o usuário consegue entender"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "28",
      "questao": "Considere os seguintes critérios de aceitação para uma história de usuário escrita a partir da perspectiva de um dono de loja online:<br> Dado que o usuário está logado e na página inicial,<br> Quando o usuário clica no botão 'Adicionar Item',<br> Então o formulário 'Criar Item' deve aparecer,<br> E o usuário deve ser capaz de inserir um nome e preço para o novo item.<br> Em qual formato esses critérios de aceitação estão escritos?",
      "alternativas": {
        "A": "Orientado a regras (Rule-oriented)",
        "B": "Orientado a cenário (Scenario-oriented)",
        "C": "Orientado a produto (Product-oriented)",
        "D": "Orientado a processo (Process-oriented)"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "29",
      "questao": "Sua equipe analisa a seguinte história de usuário para definir os critérios de aceitação:<br> Como um cliente registrado, quero poder visualizar meus pedidos anteriores no site da empresa, para que eu possa acompanhar minhas compras.<br> Qual dos seguintes casos de teste NÃO será relevante para esta história de usuário?",
      "alternativas": {
        "A": "Entrada: o cliente faz login em sua conta no site e clica no botão “ver histórico de pedidos” Resultado esperado: o sistema mostra uma lista de todos os pedidos anteriores do cliente, incluindo data, número do pedido e custo total",
        "B": "Entrada: o cliente clica em um pedido da lista de pedidos Resultado esperado: o sistema exibe os itens individuais comprados, juntamente com seus preços e quantidades",
        "C": "Entrada: o cliente clica no botão “Ordenar crescente” na tela do histórico de pedidos Resultado esperado: o sistema mostra o histórico de pedidos ordenado pelo número do pedido em ordem crescente",
        "D": "Entrada: um cliente não registrado se cadastra como novo cliente com um endereço de e-mail válido que ainda não existe na base de dados de clientes Resultado esperado: o sistema aceita o cadastro e cria a conta"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K3"
    },
    {
      "id": "30",
      "questao": "Sua equipe segue o processo que utiliza o pipeline de entrega DevOps. Os três primeiros passos desse processo são:<br> 1. Desenvolvimento de código<br> 2. Submeter o código em um sistema de controle de versão e mesclá-lo no branch “test”<br> 3. Realizar testes de componentes para o código submetido<br> Qual das seguintes opções é MELHOR adequada para ser o critério de entrada para o passo (2) deste pipeline?",
      "alternativas": {
        "A": "A análise estática não retorna alertas de alta severidade para o código submetido",
        "B": "O controle de versão do sistema não apresenta conflitos ao mesclar o código no branch 'test'",
        "C": "Os testes de componentes estão compilados e prontos para serem executados",
        "D": "A cobertura de instruções é de pelo menos 80%"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "31",
      "questao": "Você deseja estimar o esforço de teste para um novo projeto utilizando estimativa baseada em ratios. Você calcula a razão teste-desenvolvimento usando os dados médios de esforço de desenvolvimento e esforço de teste de quatro projetos históricos similares ao novo projeto. A tabela apresenta esses dados históricos:<br> O esforço estimado de desenvolvimento para o novo projeto é $800.000. Qual é a sua estimativa para o esforço de teste neste projeto?",
      "alternativas": {
        "A": "$40,000",
        "B": "$80,000",
        "C": "$81,250",
        "D": "$82,500"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoB/Q31.png"],
      "level": "K3"
    },
    {
      "id": "32",
      "questao": "Você está testando uma aplicação web que permite aos usuários PESQUISAR produtos, VER detalhes do produto, ADICIONAR produtos ao carrinho de compras e fazer um PEDIDO. Você preparou os seguintes sete casos de teste, todos os quais deseja executar. Os testes devem ser executados na melhor ordem, baseada na prioridade de teste: Você também identificou as seguintes dependências lógicas entre os casos de teste:<br> A funcionalidade PESQUISAR deve ser testada antes da funcionalidade VER.<br> A funcionalidade VER deve ser testada antes da funcionalidade ADICIONAR.<br> A funcionalidade ADICIONAR deve ser testada antes da funcionalidade PEDIDO.<br> Qual caso de teste deve ser executado como o quarto?",
      "alternativas": {
        "A": "TC3",
        "B": "TC1",
        "C": "TC7",
        "D": "TC2"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoB/Q32.png"],
      "level": "K3"
    },
    {
      "id": "33",
      "questao": "De acordo com o modelo dos quadrantes de teste, qual das opções a seguir se enquadra no quadrante Q1 (“voltado à tecnologia” e “apoia a equipe”)?",
      "alternativas": {
        "A": "Teste de usabilidade",
        "B": "Teste funcional",
        "C": "Teste de aceitação do usuário",
        "D": "Teste de integração de componentes"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "34",
      "questao": "Dados os seguintes riscos:<br> 1. Implementação ineficaz de loop causa respostas longas do sistema<br> 2. Consumidores mudam suas preferências<br> 3. Inundação da sala do servidor<br> 4. Pacientes acima de certa idade recebem relatórios imprecisos<br> E as seguintes atividades de mitigação:<br> A. Aceitação de risco (Risk acceptance) B. Teste de eficiência de performance (Testing for performance efficiency)<br> C. Usar análise de valor limite como técnica de teste (Using boundary value analysis as the test technique)<br> D. Transferência de risco (Risk transfer)<br> Qual das seguintes alternativas corresponde MELHOR os riscos com as atividades de mitigação?",
      "alternativas": {
        "A": "1C, 2D, 3A, 4B",
        "B": "1B, 2D, 3A, 4C",
        "C": "1B, 2A, 3D, 4C",
        "D": "1C, 2A, 3D, 4B"
      },
      "correta": "C",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K3"
    },
    {
      "id": "35",
      "questao": "Qual das seguintes é uma métrica de qualidade do produto?",
      "alternativas": {
        "A": "Tempo médio até falha",
        "B": "Número de defeitos encontrados",
        "C": "Cobertura de requisitos",
        "D": "Percentual de detecção de defeitos"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "36",
      "questao": "Você é membro de uma equipe de teste localizada na América do Norte, desenvolvendo um produto para um cliente localizado na Europa. A equipe é ágil, segue a abordagem DevOps e utiliza um pipeline de integração contínua / entrega contínua. Qual das seguintes formas é a menos eficaz para comunicar o progresso dos testes ao cliente?",
      "alternativas": {
        "A": "Presencial",
        "B": "Dashboards",
        "C": "E-mail",
        "D": "Videoconferência"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "37",
      "questao": "Qual das seguintes alternativas MELHOR descreve um exemplo de como o gerenciamento de configuração (CM) apoia os testes?",
      "alternativas": {
        "A": "Tendo o número da versão do ambiente, a ferramenta de CM pode recuperar os números de versão das bibliotecas, stubs e drivers usados nesse ambiente",
        "B": "Tendo um registro dos valores de entrada, a ferramenta de CM pode executar os casos de teste para essas configurações e calcular a cobertura",
        "C": "Tendo dados sobre a data de compra de uma licença de software, a ferramenta de CM gera automaticamente informações sobre o fato de que a licença do produto está prestes a expirar",
        "D": "Tendo o número da versão do caso de teste, a ferramenta de CM pode gerar automaticamente dados de teste para esse caso de teste"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "38",
      "questao": "Você está testando uma função de ordenação que recebe um conjunto de números como entrada e retorna o mesmo conjunto ordenado em ordem crescente. O log da execução do teste é o seguinte: Qual das seguintes alternativas fornece a MELHOR descrição da falha que pode ser usada em um relatório de defeito?",
      "alternativas": {
        "A": "O sistema falha ao ordenar vários conjuntos de números. Referência: TC3, TC4, TC5",
        "B": "O sistema parece desconsiderar duplicatas durante a ordenação. Referência: TC3, TC4, TC5",
        "C": "O sistema falha ao ordenar números negativos. Referência: TC4, TC5",
        "D": "TC3, TC4 e TC5 têm defeitos (dados de entrada duplicados) e devem ser corrigidos"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoB/Q38.png"],
      "level": "K3"
    },
    {
      "id": "39",
      "questao": "Dadas as seguintes descrições:<br> 1. Suportar rastreamento de workflow<br> 2. Facilitar a comunicação<br> 3. Máquinas virtuais<br> 4. Suportar revisões<br> E as seguintes categorias de ferramentas de teste:<br> A. Ferramentas de teste estático<br> B. Ferramentas que suportam escalabilidade e padronização de deployment<br> C. Ferramentas DevOps<br> D. Ferramentas de colaboração<br> Qual das alternativas MELHOR corresponde às descrições e categorias?",
      "alternativas": {
        "A": "1A, 2B, 3C, 4D",
        "B": "1B, 2D, 3C, 4A",
        "C": "1C, 2D, 3B, 4A",
        "D": "1D, 2C, 3A, 4B"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "40",
      "questao": "Qual das seguintes alternativas é MAIS PROVÁVEL de ser um benefício da automação de testes?",
      "alternativas": {
        "A": "Fornece métricas de cobertura que são muito complexas para humanos derivarem",
        "B": "Compartilha a responsabilidade pelos testes com o fornecedor da ferramenta",
        "C": "Elimina a necessidade de pensamento crítico ao analisar os resultados dos testes",
        "D": "Gera casos de teste a partir da análise do código do programa"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    }
  ]
}
