{
  "questoes": [
    {
      "id": "01",
      "questao": "Qual dos seguintes é um objetivo típico de teste?",
      "alternativas": {
        "A": "Validar que os requisitos documentados foram atendidos",
        "B": "Causar falhas e identificar defeitos",
        "C": "Iniciar erros e identificar causas raiz",
        "D": "Verificar se o objeto de teste atende às expectativas do usuário"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "02",
      "questao": "Qual das seguintes afirmações descreve MELHOR a diferença entre teste e depuração?",
      "alternativas": {
        "A": "O teste causa falhas enquanto a depuração corrige falhas",
        "B": "O teste é uma atividade negativa enquanto a depuração é uma atividade positiva",
        "C": "O teste determina que existem defeitos enquanto a depuração remove defeitos",
        "D": "O teste encontra a causa dos defeitos enquanto a depuração corrige a causa dos defeitos"
      },
      "correta": "C",
      "erradas": ["B", "A", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "03",
      "questao": "A “falácia da ausência de defeitos” é um dos princípios do teste. Qual das seguintes é um exemplo de como abordar esse princípio na prática?",
      "alternativas": {
        "A": "Explicar que não é possível que o teste mostre a ausência de defeitos",
        "B": "Apoiar os usuários finais na realização de testes de aceitação",
        "C": "Garantir que não restem defeitos de implementação no sistema entregue",
        "D": "Modificar testes que não causam falhas para garantir que poucos defeitos permaneçam"
      },
      "correta": "B",
      "erradas": ["A", "D", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "04",
      "questao": "Quais das seguintes atividades de teste são MAIS propensas a envolver a aplicação de análise de valor limite e particionamento de equivalência?",
      "alternativas": {
        "A": "Implementação de teste",
        "B": "Projeto de teste",
        "C": "Execução de teste",
        "D": "Monitoramento de teste",
        "E": "Análise de teste"
      },
      "correta": ["B", "E"],
      "erradas": ["A", "C", "D"],
      "tipo": "Checkbox",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "05",
      "questao": "Dado o seguinte testware:<br> 1. Itens de cobertura<br>2. Solicitações de mudança<br>3.Cronograma de execução de testes<br>4.Condições de teste priorizadas<br>E as seguintes atividades de teste:<br>A. Análise de teste <br>B. Projeto de teste <br>C. Implementação de teste <br>D. Conclusão de teste <br>Qual das seguintes opções MOSTRA MELHOR o testware produzido pelas atividades?",
      "alternativas": {
        "A": "1B, 2D, 3C, 4A",
        "B": "1B, 2D, 3A, 4C",
        "C": "1D, 2C, 3A, 4B",
        "D": "1D, 2C, 3B, 4A"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "06",
      "questao": "Qual das seguintes afirmações sobre os diferentes papéis de teste é MAIS provável de estar CORRETA?",
      "alternativas": {
        "A": "No desenvolvimento de software ágil, o papel de gerenciamento de teste é responsabilidade principal da equipe, enquanto o papel de teste é principalmente responsabilidade de um único indivíduo de fora da equipe",
        "B": "O papel de teste é principalmente responsável pelo monitoramento e controle de teste, enquanto o papel de gerenciamento de teste é principalmente responsável pelo planejamento e conclusão de teste",
        "C": "No desenvolvimento de software ágil, atividades de gerenciamento de teste que abrangem múltiplas equipes são tratadas por um gerente de teste externo à equipe, enquanto algumas tarefas de gerenciamento de teste são tratadas pela própria equipe",
        "D": "papel de gerenciamento de teste é principalmente responsável pela análise e projeto de teste, enquanto o papel de teste é principalmente responsável pela implementação e execução de teste"
      },
      "correta": "C",
      "erradas": ["D", "B", "A"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "07",
      "questao": "Qual dos seguintes é uma vantagem da abordagem de equipe inteira (whole-team)?",
      "alternativas": {
        "A": "Equipes sem testadores",
        "B": "Melhoria na dinâmica da equipe",
        "C": "Membros de equipe especializados",
        "D": "Tamanhos de equipe maiores"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "08",
      "questao": "Qual das seguintes afirmações sobre a independência do teste é CORRETA?",
      "alternativas": {
        "A": "Testadores independentes encontrarão defeitos devido à sua perspectiva técnica diferente dos desenvolvedores, mas sua independência pode levar a uma relação adversarial com os desenvolvedores",
        "B": "DA familiaridade dos desenvolvedores com seu próprio código significa que eles encontram apenas alguns defeitos nele; no entanto, seu conhecimento compartilhado de software com os testadores significa que esses defeitos também seriam encontrados pelos testadores",
        "C": "O teste independente requer testadores que estejam fora da equipe de desenvolvimento e, idealmente, fora da organização; no entanto, esses testadores têm dificuldade em entender o domínio da aplicação",
        "D": "Testadores de fora da equipe de desenvolvimento são mais independentes do que testadores de dentro da equipe, mas os testadores de dentro da equipe têm mais probabilidade de serem responsabilizados por atrasos na entrega do produto"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "09",
      "questao": "Qual das seguintes é uma boa prática de teste que se aplica a todos os ciclos de vida de desenvolvimento de software?",
      "alternativas": {
        "A": "Para cada nível de teste, existe um nível de desenvolvimento correspondente",
        "B": "Para cada objetivo de teste, existe um objetivo de desenvolvimento correspondente",
        "C": "Para cada atividade de teste, existe uma atividade de usuário correspondente",
        "D": "Para cada atividade de desenvolvimento, existe uma atividade de teste correspondente"
      },
      "correta": "D",
      "erradas": ["A", "C", "B"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "10",
      "questao": "Qual dos seguintes é um exemplo de uma abordagem de desenvolvimento “test-first” (teste primeiro)?",
      "alternativas": {
        "A": "Desenvolvimento Orientado a Testes de Componentes",
        "B": "Desenvolvimento Orientado a Testes de Integração",
        "C": "Desenvolvimento Orientado a Testes de Sistema",
        "D": "Desenvolvimento Orientado a Testes de Aceitação"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "11",
      "questao": "Qual das seguintes fornece a MELHOR descrição do “shift-left”?",
      "alternativas": {
        "A": "Quando acordado pelos desenvolvedores, atividades manuais do lado esquerdo do processo de teste são automatizadas para apoiar o princípio de “testes precoces economizam tempo e dinheiro”",
        "B": "uando for custo-efetivo, as atividades de teste são antecipadas no ciclo de vida de desenvolvimento de software (SDLC) para reduzir o custo total da qualidade, diminuindo o número de defeitos encontrados posteriormente no SDLC",
        "C": "Quando tiverem tempo disponível, os testadores são obrigados a automatizar testes para testes de regressão, começando com testes de componentes e testes de integração de componentes",
        "D": "Quando disponível, os testadores são treinados para executar tarefas no início do SDLC, permitindo que mais atividades de teste sejam automatizadas posteriormente no SDLC"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "12",
      "questao": "Qual das seguintes é MENOS provável de ocorrer como resultado de uma retrospectiva?",
      "alternativas": {
        "A": "A qualidade dos futuros objetos de teste melhora ao identificar melhorias nas práticas de desenvolvimento",
        "B": "A eficiência dos testes melhora ao acelerar a configuração de ambientes de teste por meio de automação",
        "C": "A compreensão dos usuários finais sobre os processos de desenvolvimento e teste é aprimorada",
        "D": "Scripts de teste automatizados são aprimorados por meio de feedback dos desenvolvedores"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "13",
      "questao": "Qual dos seguintes níveis de teste é MAIS provável de estar sendo realizado se o teste estiver focado em validação e não estiver sendo realizado por testadores?",
      "alternativas": {
        "A": "Teste de componente",
        "B": "Teste de integração de componentes",
        "C": "Teste de integração de sistema",
        "D": "Teste de aceitação"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "14",
      "questao": "O software do sistema de navegação foi atualizado porque sugeria rotas que infringiam as leis de trânsito, como dirigir na contramão de ruas de mão única. Qual das seguintes opções descreve MELHOR os testes que serão realizados?",
      "alternativas": {
        "A": "Apenas teste de confirmação",
        "B": "Teste de confirmação seguido de teste de regressão",
        "C": "Apenas teste de regressão",
        "D": "Teste de regressão seguido de teste de confirmação"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "15",
      "questao": "Dado os seguintes exemplos de defeitos:<br>i. Duas partes diferentes da especificação de design entram em conflito devido à complexidade do design<br>ii. A resposta do sistema é muito lenta, fazendo com que os usuários percam a paciência<br>iii. Um caminho no código não pode ser alcançado durante a execução<br>iv. Uma variável é declarada, mas nunca é utilizada posteriormente no programa<br>v. A quantidade de memória necessária pelo programa para gerar um relatório é muito alta<br>Qual das seguintes opções IDENTIFICA MELHOR os exemplos de defeitos que poderiam ser encontrados por teste estático (em vez de teste dinâmico)?",
      "alternativas": {
        "A": "ii, v",
        "B": "iii, v",
        "C": "i, ii, iv",
        "D": "i, iii, iv"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "16",
      "questao": "Qual dos seguintes é um benefício do feedback precoce e frequente das partes interessadas?",
      "alternativas": {
        "A": "Mudanças nos requisitos são compreendidas e implementadas mais cedo",
        "B": "Garante que as partes interessadas do negócio entendam os requisitos dos usuários",
        "C": "Permite que os proprietários do produto alterem seus requisitos sempre que quiserem",
        "D": "Os usuários finais são informados sobre quais requisitos não serão implementados antes da liberação"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "17",
      "questao": "Dado os seguintes tipos de revisão:<br>1. Revisão técnica<br>2. Revisão informal<br>3. Inspeção<br>4. Walkthrough<br>E as seguintes descrições:<br>A. Inclui objetivos como obter consenso, gerar novas ideias e motivar os autores a melhorar<br>B. Inclui objetivos como educar os revisores, obter consenso, gerar novas ideias e detectar defeitos potenciais<br>C. O principal objetivo é detectar defeitos potenciais e requer coleta de métricas para apoiar a melhoria do processo<br>D. O principal objetivo é detectar defeitos potenciais e não gera saída formal documentada<br>Qual das seguintes opções corresponde MELHOR os tipos de revisão às descrições?",
      "alternativas": {
        "A": "1A, 2B, 3C, 4D",
        "B": "1A, 2D, 3C, 4B",
        "C": "1B, 2C, 3D, 4A",
        "D": "1C, 2D, 3A, 4B"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "18",
      "questao": "Qual dos seguintes é um fator que contribui para uma revisão bem-sucedida?",
      "alternativas": {
        "A": "Garantir que a gerência participe como revisores",
        "B": "Dividir grandes produtos de trabalho em partes menores",
        "C": "Definir a avaliação dos revisores como um objetivo",
        "D": "Planejar revisar um documento por vez"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "19",
      "questao": "Qual é a PRINCIPAL diferença entre técnicas de teste black-box e técnicas de teste baseadas em experiência?",
      "alternativas": {
        "A": "O objeto de teste",
        "B": "O nível de teste no qual a técnica de teste é usada",
        "C": "A base do teste",
        "D": "O ciclo de vida de desenvolvimento de software (SDLC) no qual a técnica de teste pode ser usada"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "20",
      "questao": "Você está testando um validador de PIN, que aceita PINs válidos e rejeita PINs inválidos. Um PIN é uma sequência de dígitos. Um PIN é válido se consistir em quatro dígitos, que não sejam todos iguais. Você identificou as seguintes partições de equivalência válidas: Variável: Comprimento do código PIN ->Partição “comprimento correto” ->Partição “comprimento incorreto” Variável: Número de dígitos diferentes (para PINs de quatro dígitos) ->Partição “número de dígitos diferentes correto” – PINs com pelo menos dois dígitos diferentes ->Partição “número de dígitos diferentes incorreto” – PINs com todos os dígitos iguais; Qual dos seguintes é o MELHOR conjunto de dados de teste de entrada para cobrir as partições de equivalência identificadas?",
      "alternativas": {
        "A": "12, 1111, 1234, 12345",
        "B": "1, 123, 1111, 1234",
        "C": "11, 12, 1111, 12345",
        "D": "123, 1222, 12345"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K3"
    },
    {
      "id": "21",
      "questao": "Um desenvolvedor foi solicitado a implementar a seguinte regra de negócio: Você projeta os casos de teste usando análise de valor limite com 2 valores. Qual dos seguintes conjuntos de entradas de teste atinge a maior cobertura?",
      "alternativas": {
        "A": "100, 150, 200, 201",
        "B": "99, 100, 200, 201",
        "C": "98, 99, 100, 101",
        "D": "101, 150, 199, 200"
      },
      "correta": "D",
      "erradas": ["B", "C", "A"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoC/Q21.png"],
      "level": "K3"
    },
    {
      "id": "22",
      "questao": "Você está trabalhando em um projeto para desenvolver um sistema de análise de resultados de exames de direção. Foi solicitado que você projetasse casos de teste com base na seguinte tabela de decisão: Qual conjunto de dados de teste mostrará que existem regras contraditórias na tabela de decisão?",
      "alternativas": {
        "A": "C1 = T,  C2 = T,  C3 = F",
        "B": "C1 = T,  C2 = F,  C3 = T",
        "C": "C1 = T,  C2 = T,  C3 = T and C1 = F, C2 = T, C3 = T",
        "D": "C1 = F,  C2 = F,  C3 = F"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoC/Q22.png"],
      "level": "K3"
    },
    {
      "id": "23",
      "questao": "Você está projetando casos de teste com base no seguinte diagrama de transição de estados: Qual é o NÚMERO MÍNIMO de casos de teste necessário para alcançar 100% de cobertura de transições válidas?",
      "alternativas": {
        "A": "3",
        "B": "2",
        "C": "5",
        "D": "6"
      },
      "correta": "A",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoC/Q23.png"],
      "level": "K3"
    },
    {
      "id": "24",
      "questao": "Uma aplicação em lote está em produção inalterada há mais de dois anos. Ele funciona durante a noite uma vez por mês para produzir declarações que serão enviadas aos clientes por e-mail. Para cada cliente, o aplicativo passa por cada conta e lista todas as transações nessa conta no último mês. Ele usa uma estrutura neste loop para processar clientes (loop externo), as contas de cada cliente (loop médio) e as transações de cada conta (loop interno). Uma noite, o pedido de lote termina prematuramente, deixando de enviar extratos por e-mail a alguns clientes, quando encontra um cliente com uma conta para a qual não ocorreram transações no último mês. Esta é uma situação muito incomum e não tem ocorrido nos anos desde que este aplicativo foi colocado em produção. Enquanto conserta o defeito, um programador pede que você recomende técnicas de teste que sejam eficazes contra este tipo de defeito. Qual das seguintes técnicas de teste provavelmente teria sido capaz de detectar o defeito subjacente?",
      "alternativas": {
        "A": "Teste de decisão",
        "B": "Teste de declaração",
        "C": "Testes baseados em listas de verificação",
        "D": "Suposição de erros"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoC/Q24.png"],
      "level": "K3"
    },
    {
      "id": "25",
      "questao": "Como o teste de caixa branca pode ser útil no suporte ao teste de caixa preta?",
      "alternativas": {
        "A": "As métricas de cobertura de caixa branca podem ajudar os testadores a avaliar os testes de caixa preta em termos da cobertura de código alcançada por esses testes de caixa preta",
        "B": "A análise de cobertura de caixa branca pode ajudar os testadores a identificar trechos inalcançáveis do código-fonte",
        "C": "O teste de ramos (branch testing) subsume as técnicas de teste de caixa preta, portanto alcançar cobertura total de ramos garante alcançar cobertura total de qualquer técnica de caixa preta",
        "D": "As técnicas de teste de caixa branca podem fornecer itens de cobertura para técnicas de caixa preta"
      },
      "correta": "A",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "26",
      "questao": " Considere a seguinte lista:<br> 1. Entrada correta não aceita<br>2. Entrada incorreta aceita<br>3. Formato de saída incorreto<br>4. Divisão por zero<br>Qual técnica de teste é MAIS PROVAVELMENTE usada pelo testador que utiliza essa lista ao realizar os testes?",
      "alternativas": {
        "A": "este exploratório",
        "B": "Ataque a falhas (fault attack)",
        "C": "Teste baseado em checklist",
        "D": "Análise de valor limite"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "27",
      "questao": "Qual das seguintes opções descreve MELHOR como o uso de testes baseados em checklist pode resultar em aumento de cobertura?",
      "alternativas": {
        "A": "Os itens do checklist podem ser definidos em um nível suficientemente detalhado, de modo que o testador possa implementar e executar casos de teste detalhados com base nesses itens",
        "B": "Os checklists podem ser automatizados, então cada vez que uma execução de teste automatizado cobre os itens do checklist, isso resulta em cobertura adicional",
        "C": "Cada item do checklist deve ser testado separadamente e de forma independente, de modo que os elementos cubram diferentes áreas do software",
        "D": "Dois testadores projetando e executando testes com base nos mesmos itens de checklist de alto nível normalmente realizarão os testes de maneiras ligeiramente diferentes"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "28",
      "questao": "Qual das seguintes fornece o MELHOR exemplo de um critério de aceitação orientado a cenário?",
      "alternativas": {
        "A": "O aplicativo deve permitir que os usuários excluam sua conta e todos os dados associados mediante solicitação",
        "B": "Quando um cliente adiciona um item ao carrinho e prossegue para o checkout, ele deve ser solicitado a fazer login ou criar uma conta caso ainda não tenha feito isso",
        "C": "IF (contain(product(23).Name, cart.products())) THEN return FALSE",
        "D": "O site deve estar em conformidade com os Padrões de Acessibilidade ICT 508 e garantir que todo o conteúdo seja acessível a usuários com deficiência"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "29",
      "questao": "Você está usando desenvolvimento orientado a testes de aceitação (ATDD) e projetando casos de teste com base na seguinte user story:<br>Como um usuário Regular ou Especial, quero poder usar meu cartão eletrônico de acesso para acessar andares específicos.<br>Critérios de Aceitação:<br>AC1: Usuários Regulares têm acesso aos andares 1 a 3<br>AC2: O andar 4 é acessível apenas para Usuários Especiais<br>AC3: Usuários Especiais têm todos os direitos de acesso dos Usuários Regulares<br>Qual caso de teste é o MAIS razoável para testar o AC3?",
      "alternativas": {
        "A": "Verificar que um usuário Regular pode acessar os andares 1 e 3",
        "B": "Verificar que um usuário Regular não pode acessar o andar 4",
        "C": "Verificar que um usuário Especial pode acessar o andar 5",
        "D": "Verificar que um usuário Especial pode acessar os andares 1, 2 e 3"
      },
      "correta": "D",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K3"
    },
    {
      "id": "30",
      "questao": "Qual das seguintes NÃO é uma finalidade de um plano de teste?",
      "alternativas": {
        "A": "Definir os dados de teste e os resultados esperados para testes de componentes e testes de integração de componentes",
        "B": "Definir como critério de saída do nível de teste de componentes que '100% de cobertura de instruções e 100% de cobertura de ramos devem ser alcançados'",
        "C": "Descrever quais campos o relatório de progresso de teste deve conter e qual deve ser o formato desse relatório",
        "D": "Explicar por que o teste de integração de sistema será excluído dos testes, embora a estratégia de teste exija esse nível de teste"
      },
      "correta": "A",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "31",
      "questao": "No início de cada iteração, a equipe estima o trabalho necessário (em pessoa-dias). A partir da terceira iteração, a equipe usa o seguinte modelo de extrapolação: O gráfico mostra o trabalho estimado e real para as 4 primeiras iterações. Qual é o valor estimado de trabalho para a iteração #5?",
      "alternativas": {
        "A": "10,5 pessoa-dias",
        "B": "8,25 pessoa-dias",
        "C": "6,5 pessoa-dias",
        "D": "9,4 pessoa-dias"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoC/Q31.png"],
      "level": "K3"
    },
    {
      "id": "32",
      "questao": "Você está preparando um cronograma de execução de testes para executar sete casos de teste, TC1 a TC7. A figura a seguir inclui as prioridades desses casos de teste (1 = prioridade mais alta, 3 = prioridade mais baixa). A figura também mostra as dependências entre os casos de teste usando setas. Por exemplo, a seta de TC4 para TC5 significa que o TC5 só pode ser executado se o TC4 tiver sido executado previamente. Qual caso de teste deve ser executado em sexto lugar?",
      "alternativas": {
        "A": "TC 3 ",
        "B": "TC 5 ",
        "C": "TC 6",
        "D": "TC 2 "
      },
      "correta": "C",
      "erradas": ["B", "C", "D"],
      "tipo": "Radio button",
      "imagens": ["./assets/img/SimuladoC/Q32.png"],
      "level": "K1"
    },
    {
      "id": "33",
      "questao": "O que o modelo da pirâmide de testes mostra?",
      "alternativas": {
        "A": "Que os testes podem ter diferentes prioridades",
        "B": "Que os testes podem ter diferentes granularidades",
        "C": "Que os testes podem exigir diferentes critérios de cobertura",
        "D": "Que os testes podem depender de outros testes"
      },
      "correta": "B",
      "erradas": ["D", "A", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K1"
    },
    {
      "id": "34",
      "questao": "Qual é a relação entre os quadrantes de teste, os níveis de teste e os tipos de teste?",
      "alternativas": {
        "A": "Os quadrantes de teste representam combinações específicas de níveis de teste e tipos de teste, definindo sua localização no ciclo de vida do desenvolvimento de software",
        "B": "Os quadrantes de teste descrevem o grau de granularidade dos tipos de teste individuais realizados em cada nível de teste",
        "C": "Os quadrantes de teste atribuem os tipos de teste que podem ser realizados aos níveis de teste",
        "D": "Os quadrantes de teste agrupam níveis de teste e tipos de teste por vários critérios, como direcionamento a partes interessadas específicas"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "35",
      "questao": "Qual dos seguintes é um exemplo de como a análise de risco do produto pode influenciar a profundidade e o escopo dos testes?",
      "alternativas": {
        "A": "O monitoramento contínuo de riscos permite identificar um risco emergente o mais cedo possível",
        "B": "A identificação de riscos permite implementar atividades de mitigação de riscos e reduzir o nível de risco",
        "C": "O nível de risco avaliado ajuda a selecionar o rigor dos testes",
        "D": "A análise de riscos permite derivar itens de cobertura"
      },
      "correta": "C",
      "erradas": ["A", "B", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "36",
      "questao": "Qual das seguintes atividades no processo de teste faz MAIS uso dos relatórios de progresso de teste?",
      "alternativas": {
        "A": "Projeto de teste",
        "B": "Conclusão de teste",
        "C": "Análise de teste",
        "D": "Planejamento de teste"
      },
      "correta": "B",
      "erradas": ["A", "D", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "37",
      "questao": "Qual das seguintes NÃO é um exemplo de como o gerenciamento de configuração apoia os testes?",
      "alternativas": {
        "A": "Todos os commits no repositório são identificados de forma única e controlados por versão",
        "B": "Todas as alterações nos elementos do ambiente de teste são rastreadas",
        "C": "Todas as especificações de requisitos são referenciadas de forma inequívoca nos planos de teste",
        "D": "Todos os defeitos identificados têm um status atribuído"
      },
      "correta": "D",
      "erradas": ["A", "C", "B"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "38",
      "questao": "Considere o seguinte relatório de defeito para uma aplicação de compras web:<br>Aplicação: WebShop v0.99<br>Defeito: Botão de login não funciona<br>Passos para reproduzir:<br>Abrir o site<br>Clicar no botão de login<br>Resultado esperado: O usuário deve ser redirecionado para a página de login<br>Resultado real: O botão de login não responde ao ser clicado<br>Severidade: Alta<br>Prioridade: Urgente<br>Qual é a informação MAIS importante que está faltando neste relatório de defeito?",
      "alternativas": {
        "A": "Nome do testador e data",
        "B": "Elementos do ambiente de teste e suas versões",
        "C": "Identificação do objeto de teste",
        "D": "Impacto nos interesses das partes interessadas"
      },
      "correta": "B",
      "erradas": ["A", "C", "D"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K3"
    },
    {
      "id": "39",
      "questao": "Ferramentas de qual das seguintes categorias ajudam na organização de casos de teste, defeitos detectados e gerenciamento de configuração?",
      "alternativas": {
        "A": "Ferramentas de execução de teste e cobertura",
        "B": "Ferramentas de projeto e implementação de teste",
        "C": "Ferramentas de gerenciamento de defeitos",
        "D": "Ferramentas de gerenciamento de teste"
      },
      "correta": "D",
      "erradas": ["A", "B", "C"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    },
    {
      "id": "40",
      "questao": "Qual dos seguintes é MAIS provável de ser um benefício da automação de testes?",
      "alternativas": {
        "A": "A capacidade de gerar casos de teste sem acesso à base de teste",
        "B": "A obtenção de maior cobertura por meio de uma avaliação mais objetiva",
        "C": "O aumento do tempo disponível para execução de testes com maior poder de processamento",
        "D": "A prevenção de erros humanos por meio de maior consistência e repetibilidade"
      },
      "correta": "D",
      "erradas": ["B", "C", "A"],
      "tipo": "Radio button",
      "imagem": "",
      "level": "K2"
    }
  ]
}
